ActiveRecord/Projects/URLShortener/app/models/shortened_url.rb

    def self.random_code
        not_yet = 0
        until not_yet == 1
            dankaku = SecureRandom::urlsafe_base64
            if self.exists?(:short_url => dankaku) == false
                not_yet = 1
            end
        end

        dankaku
    end

    #This is what they define as a factory method. *shrugs* Doesn't match waht the internet defines as a factory method.
    def self.create_url(user, long_url)
---
SELECT "shortened_urls".* FROM "shortened_urls"
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "RmhZQ1X10IZi68mBF8bkHQ"], ["LIMIT", 1]]
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["short_url", "RmhZQ1X10IZi68mBF8bkHQ"], ["long_url", "reddit.com"], ["user_id", 7]]