ActRecord2/Projects/polls_app/app/models/response.rb

    def sibling_response
        self.question.responses.where.not(id: self.id)
---
SELECT "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."q_id" WHERE "answer_choices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]